Repository: oscarahalvorsen/masterproject
Catalog: datacollecting/MAALFRID/tmx/forsvaret.no.csv-en-nb.deduped.tmx
Source language: en
Languages: nb

source: The education takes around twelve months and of a combination of theory, simulator training and practical flying.
nb: Utdanningen tar rundt tolv måneder og av en kombinasjon av teori, simulatortrening og praktisk flygning.

source: Shear force, torque and deflection diagrams, stress analysis of the cross section midships, buckling of columns and plate fields, shock loads and ship's response, periodic inspection and maintenance of the hull, rules/standards for the construction of war vessels, Norwegian Maritime Directorate's and classification societies' regulations for merchant vessels, vessel classification.
nb: Skjærkraft-, moment-, og defleksjonsdiagrammer, Spenningsanalyse av tverrsnitt ved midtstasjonen, Knekning av søyler og platefelt, Sjokklaster og skipets respons, Periodisk besiktigelse og vedlikehold av skroget., Regler/standarder for bygging av krigsfartøy, Sjøfartsdirektoratets forskrifter og klasseselskaps regelverk for handelsfartøy, klassesystematikk.

source: Chapter 1.1.2.9 Information from charts, lists of lights and other publications
nb: Kapittel 1.1.2.9 Informasjon fra kart, fyrlister og andre publikasjoner

source: • describe curves, surfaces and spatial areas through equations and differences, by using different types or coordinates, and by using parameter representations
nb: • beskrive kurver, flater og romlige områder ved likninger og ulikheter, ved å benytte forskjellige typer koordinater, og ved bruk av parameterfremstillinger

source: Lectures, exercises, laboratory work, hackathon / project and field trip.
nb: Forelesninger, øvinger, laboratoriearbeid, hackathon/prosjekt og ekskursjon.

source: • prepare security documentation that highlight security requirements and operativ effects of security insidents
nb: • utarbeide sikkerhetsdokumentasjon som synliggjør sikkerhetskrav og operativ konsekvens av sikkerhetshendelser

source: Naval, NATO civilian regulations on the subject.
nb: Sjømilitære, NATO og sivile regelverk innen emnet.

source: Perspective and Analysis further develops the cadets' knowledge of and skills in English as a working language in the Air Force.
nb: Perspectives and Analysis videreutvikler kadettenes kunnskap om og ferdigheter i engelsk som arbeidsspråk i Luftforsvaret.

source: The candidate has broad knowledge of data and telecommunications, information security and military operations in the cyber domain.
nb: Kandidaten har bred kunnskap om data- og telekommunikasjon, informasjonssikkerhet og militære operasjoner i cyberdomenet.

source: analyse the role and significance of NATO for Norwegian and international security
nb: analysere NATOs rolle og betydning for norsk og internasjonal sikkerhet

source: Coaching skilles and significance for own leadership
nb: Veiledningsferdigheter og betydning for eget lederskap

source: operate main ship engines in safe manner in simulator and in laboratory.
nb: operere hovedskipsmaskineri på sikker måte i simulator og i laboratoriet.

source: Military and civilian regulations on the subject
nb: Militære og sivile regelverk innen emnet

source: Construction of hull structures, the lines drawing basis for hull construction.
nb: Oppbygging av skrogstrukturer, tegningsgrunnlaget for bygging av skroget.

source: Explain the technological possibilities and limitations involved in land operations.
nb: forklare muligheter og begrensninger teknologien gir i landoperasjoner.

source: Principles and maintenance of navigation equipment, lanterns and communication systems.
nb: Prinsipper og vedlikehold av navigasjonsutstyr, lanterner og kommunikasjonssystemer.

source: In addition to the curriculum from course 1-4 (autumn semester):
nb: I tillegg til pensum fra emne 1-4(høstsemesteret)

source: Each student is responsible for acquiring relevant literature for the thesis.
nb: Kadettene skal selv fremskaffe relevant litteratur som er dekkende for metode og teori som anvendes i oppgaven.

source: Apply knowledge of current national and international rules and regulations for the operation and running of ships in general and the special characteristics of naval vessels.
nb: Kjennskap til aktuelle nasjonale og internasjonale regler og forskrifter for drift og operasjon av skip generelt og marinefartøyers særegenhet spesielt.

source: • facilitate own studies in a targeted and efficient manner
nb: • tilrettelegge egne studier målrettet og effektivt

source: The students will work on their thesis during one academic year (August-May).
nb: Det er satt av ett studieår (august-mai) til arbeid med masteroppgaven.

source: The course must be seen in connection with course 5 (SL) and the course Practical Military Navigation.
nb: Emnet må sees i sammenheng med emne 5 (SL) ogemnet militær praktisk navigasjon.

source: Presentation of lines plans, calculation of hydrostatic sizes and coefficients, curve sheets
nb: Framstilling av linjetegning, beregning av hydrostatiske størrelser og koeffisienter, Kurveblad

source: The focus of the period will be to plan and carry out training aimed at increasing your own physical fitness and athletic skills within relevant physical and military disciplines.
nb: Fokuset i perioden vil være å planlegge og gjennomføre trening mot å øke egen fysisk form og idrettslige ferdigheter innenfor relevante fysiske og militære disipliner.

source: You begin with Clausewitz' thoughts on the nature and being of war, which was studied in module 3 "The Officer and War”, and then look closer at several theories which, in summary, forms the basis for the manoeuvre warfare approach that the Norwegian Armed Forces Land Operations Doctrine builds upon.
nb: Man tar utgangspunkt i Clausewitz’ tanker om krigens natur og vesen, som ble studert i modul 3 «Offiseren og krigen», og ser nærmere på flere teorier som i sum danner grunnlaget for manøverkrigstilnærmingen FDLO bygger på.

source: Since 1949, NATO has been the most important arena for transatlantic defence and security policy cooperation.
nb: Siden 1949 har NATO vært den viktigste arenaen for transatlantisk forsvars- og sikkerhetspolitisk samarbeid.

source: use introspection and be aware of personal behaviour, thought patterns and emotions in relation to and in interaction with others.
nb: Anvende sin selvinnsikt, og være bevisst egen atferd, tankemønster og emosjoner i relasjon til og i samspill med andre.

source: Lectures, compulsory project work and weekly assignments (of which six are mandatory).
nb: Forelesninger, obligatorisk prosjektarbeid og ukentlige oppgaver (hvorav seks er arbeidskrav).

source: The course Military joint operations - part 1 is made up of four different thematic parts.
nb: Emne Militære fellesoperasjoner – del 1 er bygget opp av fire ulike tematiske deler.

source: critically analyse the development and content of the key doctrines of high and low intensity operations after 1970, as well as assess the potential application of these doctrines for Norwegian ground forces today.
nb: kritisk analysere utviklingen av og innholdet i de sentrale doktrinene for høy- og lavintensitetsoperasjoner etter 1970, samt vurdere anvendeligheten av disse doktrinene for norske landstyrker i dag.

source: Under supervision, exercise peer support and suicide prevention measures.
nb: Under veiledning utøve kollegastøtte og selvmordsforebyggende tiltak.

source: Strength, structure and hull maintenance:
nb: Styrke, struktur og skrogvedlikehold:

source: relate the Navy's terminology, goals, strategies and systems for Navy vessel maintenance.
nb: gjengi Sjøforsvarets terminologi, målsetning, strategi og systemer for vedlikehold av Sjøforsvarets fartøyer.

source: The course uses It’s Learning/Teams.
nb: Faget bruker Itslearning/Teams.

source: assess how Norwegian and international security policies provide framework conditions and prerequisites for military decision-making at a strategic and operational level.
nb: vurdere hvordan internasjonal og norsk sikkerhetspolitikk utgjør rammebetingelser og forutsetninger for militær beslutningstaking på strategisk og operasjonelt nivå.

source: • Dual integrals and triple integrals
nb: • Dobbeltintegral og trippelintegral

source: Articles and compendiums provided by the teacher.
nb: Utdelte artikler og kompendier er støttelitteratur.

source: • describe with own words the connection between hardware and software
nb: • fortelle med egne ord sammenhengen mellom hardware og software

source: • describe methods for generating modulated signals
nb: • beskrive metoder for å generere modulerte signal

source: evaluate and refer to information and subject matter and present this so that it sheds light on a problem.
nb: vurdere og henvise til informasjon og fagstoff og framstille dette slik at det belyser en problemstilling

source: Independent problem solving is focused on the MilGeo officer's contribution to the intelligence assessment (IPOE) in the framework of the planning and decision-making process (PBP).
nb: Det legges opp til selvstendig problemløsning med fokus på MilGeo-offiserens bidrag til etterretningsvurderingen (IPOE) i rammen av plan- og beslutningsprosessen (PBP).

source: Exercise your leadership and service according to the standards, ethics and legal foundations of the Norwegian Armed Forces, and live according to these principles
nb: utøve sitt lederskap og tjeneste etter Forsvarets verdimessige, etiske og rettslige grunnlag og leve etter disse prinsippene

source: discuss the most important developments within high and low intensity doctrines regarding ground forces after 1970.
nb: drøfte de viktigste utviklingstrekk innenfor høy- og lavintensive landmilitære doktriner etter 1970.

source: construct simple systems for digital signal processing and transmission.
nb: konstruere enkle systemer for digital signalbehandling og transmisjon.

source: In topic 2, the "Winter Exercise" is also carried out.
nb: I tema 2 gjennomføres også «vinterøvelsen».

source: Convey key subject matter, problems and solutions both in writing and orally.
nb: Formidle sentralt fagstoff, problemstillinger og løsninger skriftlig og muntlig.

source: The total workload will be approx. 200 hours.
nb: Totall arbeidsmengde vil være på ca. 200 timer.

source: maintain and enhance his/her own physical fitness and athletic skills
nb: vedlikeholde og øke egen fysisk form og idrettslige ferdigheter.

source: effectively make wise decisions in light of strategic, tactical, physical, technical, as well as legal and moral conditions.
nb: effektivt ta kloke beslutninger i lys av strategiske og taktiske, fysiske og tekniske, samt juridiske og moralske forhold.

source: explain the operation, possibilities and limitations of sensor, communication and navigation systems
nb: forklare sensor-, sambands- og navigasjonssystemers virkemåte, muligheter og begrensninger

source: ) Regulations relating to qualifications and certificates for seamen.
nb: ) Forskrift om kvalifikasjoner og sertifikater for sjøfolk.

source: account for key conditions affecting the foreign policy of states, and international cooperation and conflict.
nb: redegjøre for sentrale forhold som påvirker staters utenrikspolitikk og internasjonalt samarbeid og konflikt.

source: Energy conversion rate based on the cylinder pressure course using simulator and laboratory exercise.
nb: Energiomsetningshastighet basert på sylindertrykkforløpet med bruk av simulator- og laboratorieøvelse.

source: Half the class sails with SOA at 24 knots in the fairway between Bergen and Tromsø.
nb: Halve klassen seiler med SOA 24 knop i leden mellom Bergen og Tromsø.

source: Analysis and simulation of digital filters and transmission systems using Matlab/Simulink
nb: Analyse og simulering av digitale filtre og transmisjonssystemer vha Matlab/Simulink

source: Theme 1 will require cadets to reflect upon the requirements society places upon the individual officer as a leader, as well as the requirements placed on the military profession.
nb: I tema 1 skal kadettene reflektere over de krav som stilles fra samfunnet til den enkelte offiser som leder og til den militære profesjonen.

source: The course will give the cadet an introduction to methods of circuit analysis, such as the node voltage method, source transformations, Thevenin and Norton equivalents and the mode-superposition method.
nb: Emnet skal gi kadettem innføring imetoder i kretsanalyse, som nodespenningsmetoden, kildetransformasjoner, Thevenin og Norton- ekvivalenter og superposisjonsmetoden.

source: Modulation and coding.
nb: Modulasjon og koding.

source: We will also deal with UN peace operations in a horizontal perspective.
nb: Valgemnet vil også omhandle FN-operasjonene i et horisontalt perspektiv.

source: Explain what assumptions must be due to the development and safeguarding of security culture in operational organisations such as the RNAF.
nb: forklare hvilke forutsetninger som må ligge til grunn for utvikling og ivaretakelse av sikkerhetskultur i en operativ organisasjon som Luftforsvaret.

source: discuss the key military theoretical ideas that have laid the foundations for high and low intensity land operations after 1970.
nb: drøfte de sentrale militærteoretiske retningene som har lagt grunnlaget for høy- og lavintensive landoperasjoner etter 1970.

source: Furthermore, the aim of the course is to help the students to problematise and understand the possibilities and limitations of the contributions of ground forces in the subsequent course Joint Operations 2.
nb: Hensikten er videre at emnet skal hjelpe elevene med å problematisere og forstå mulighetene og begrensningene for landkomponentens bidrag inn i det etterfølgende emnet Fellesoperasjoner 2.

source: Following the final session, the students complete their papers.
nb: Etter siste samling ferdigstiller studentene sine papers.

source: Theme 3/Part 2: Protecting civilians from violence
nb: Tema 3/Del 2: Beskyttelse av sivile fra vold

source: Section 1 deals with how the political and strategic management level sets the framework for and influences the use of air power.
nb: Tema 1 tar for seg hvordan det politiske- og strategiske ledelsesnivået setter rammer for og innvirker på anvendelsen av luftmakt.

source: The course gives the cadets an introduction to Norwegian security and defense policy, including central international and legal frameworks for Norwegian security and the use of military power.
nb: Emnet gir kadettene en innføring i norsk sikkerhets- og forsvarspolitikk, herunder sentrale internationale og rettslige rammer for norsk sikkerhet og bruk av militærmakt.

source: Module 2: Military technology and innovation
nb: Delemne 2: Militær teknologi og innovasjon

source: Protecting civilians from violence is the most important task for UN peace operations.
nb: Beskyttelse av sivile er FNs viktigste oppgave i dag.

source: an understanding of the basic principles of ship construction (civil and military)
nb: forståelse for grunnprinsippene innen skipskonstruksjon (Sivilt og militært)

source: Clutches and couplings, dimensioning of swage and shrinkage couplings.
nb: Klutsjer og koblinger, dimensjonering av press og krympeforbindelser.

source: Lectures, assignment solving, group/plenary discussions, reflection log, news briefs in English and case studies
nb: Forelesninger, oppgaveløsning, gruppe-/plenumsdiskusjoner, refleksjonslogg, nyhetsbriefer på engelsk og tilfellestudier

source: The thesis and the plan for completing the thesis are to be presented during teaching week 5.
nb: Oppgaven og planen for gjennomføring av oppgaven skal presenteres i løpet av undervisningsuke 5.

source: Lectures, military exercise, seminars, presentation and process writing.
nb: Forelesninger, militærøvelse, seminarer, presentasjon og prosesskriving.

source: Hydraulics, hydraulic fluid properties, passive and active components.
nb: Hydraulikk, hydrauliske væskers egenskaper, passive og aktive komponenter.

source: Classifying bridges for military vehicles.
nb: Klassifisere bruer for militære kjøretøy.

source: explain the intelligence cycle as a method and tool, including conceptual apparatus, process flow and roles
nb: forklare etterretningssyklusen som metode og verktøy, herunder begrepsapparat, prosessflyt og roller

source: Military problem-solving within the framework of staff studies and the planning and decision-making process for the peacetime service and wartime service respectively allows the cadet to make decisions as a leader and staff officer.
nb: Vitenskapelig metode, kunnskapsteori og beslutningsteori gir et grunnlag for kritisk tenkning og en forståelse for premissene og rammene for stabsstudien og plan- og beslutningsprosessen.

source: basic knowledge of satellite-based navigation systems, ECDIS and AIS.
nb: grunnlegende kunnskap om satellittbaserte navigasjonssystemer, ECDIS og AIS.

source: use idiomatic language orally and in writing, and be able to recognise and transfer relevant knowledge between different contexts
nb: benytte idiomatiske strukturer på engelsk både skriftlig og muntlig, og kan gjenkjenne samt overføre relevant læring mellom ulike kontekster

source: The total tutoring time includes reading / written commentary on the assignment, other preparations, as well as up to 10 hours of direct student contact.
nb: Den samlede veiledningstiden inkluderer lesing/skriftlig kommentering av oppgaven, øvrige forberedelser, samt opptil 10 timer direkte studentkontakt.

source: summarise key features from research and development work in own field, and describe relevant methods and work methods in the engineering discipline, including applications in a military context.
nb: gjengi hovedtrekk fra forsknings- og utviklingsarbeid innenfor eget fagfelt, samt beskrive relevante metoder og arbeidsmåter innenfor ingeniørfaget, inkludert anvendelser i militær sammenheng

source: Ship geometry and hydrostatics:
nb: Skipets geometri og hydrostatikk:

source: Page numbers given here are for Creswell 2014 and do not correspond to Creswell & Creswell 2018.
nb: Sidetallene er her gitt for Creswell 2014 og stemmer ikke for Creswell og Creswell 2018, men kapittelnumrene er de samme i begge utgaver.

source: maintain their convention-based and function-oriented maritime certificate responsibility described in STCW code: A-III/1 and A-III/2 with STCW function: Controlling the operation of the ship and care for persons on board at the operational and management level.
nb: ivareta sitt konvensjonsbaserte og funksjonsrettede maritime sertifikatansvar beskrevet i STCW-kode: A-III/1 og A-III/2 med STCW-funksjon:

source: Configure and operate deployable and tactical communications infrastructure
nb: Konfigurere og drifte deployerbar og taktisk kommunikasjonsinfrastruktur

source: The course is based on ING1501 The Cyber engineer’s profession, ING3501 Role and communication 1 and OR5 education
nb: Emnet bygger på ING1501 Cyberingeniørens profesjon, ING3501 Rolle og kommunikasjon 1 og OR5-utdanning

source: The first semester of the education takes place at Heistadmoen and the Military Academy.
nb: Utdanningens første semester gjennomføres ved Heistadmoen og ved avdeling Krigsskolen.

source: One year of study (August-May) is set for work on the master's thesis.
nb: Det er satt av ett studieår (august-mai) til arbeid med masteroppgaven.

source: find, assess, use and refer to information and literature and present this such that it sheds light on a problem.
nb: finne, vurdere, bruke og henvise til informasjon og fagstoff og framstille dette slik at det belyser en problemstilling.

source: Additional reading for students using qualitative methods in their masters thesis (164 p.
nb: Tilleggspensum for deg som skal bruke kvantitativ metode i masteroppgaven (164 s.

source: Norwegian tides - independent study (gone through in Nav 1) ADL UK tidal streams in charts UK tidal range
nb: Norsk tidevann – selvstudie (utført i Nav 1) ADL Engelsk tidevannsstrøm i kart

source: Based on military theoretical perspectives and the basis for doctrines taught in the course Joint Military Operations 1, Joint Military Operations 2 will largely focus on the skill aspects of the military core competence.
nb: Med utgangspunkt i militærteoretiske perspektiver og doktrinegrunnlag gitt i emnet militære fellesoperasjoner 1, vil militære fellesoperasjoner 2 i stor grad fokusere på de ferdighetsmessige sidene av den militære kjernekompetansen.

source: The course builds upon knowledge gained from natural science subjects Mathematics R1 and Physics 1 and will
nb: Emnet bygger videre på realfagskunnskap fra Matematikk R1 og Fysikk 1 og skal

source: Explain how your own platoon/organisation can operate in the environment being operated in.
nb: Forklare hvordan egen avdeling/organisasjon kan operere i operasjonsmiljøet.

source: The Master of Military Studies (90 ECTS) is an experience-based professional study for employment within the Norwegian Armed Forces/defence sector.
nb: Master i militære studier (90 studiepoeng) er et erfaringsbasert profesjonsstudium for tilsatte i Forsvaret/forsvarssektoren.

source: use computers and computer networks as equipment in the lab as well as in maritime systems for measurement, management and control
nb: bruke datamaskiner og datanettverk som måleutstyr på laboratoriet og i maritime systemer for måling, styring og kontroll

source: Military technology is characterised by the race between capabilities and counter-capabilities, and this sets the framework for understanding military innovation in this module.
nb: Militær teknologi kjennetegnes av kappløpet mellom middel og motmiddel, og dette danner rammen av forståelsen for militær innovasjon i dette delemnet.

source: perform readings, analyse collected data and calculate thermal and mechanical conditions for auxiliary machinery.
nb: gjennomføre målinger, analysere innsamlede data og beregne termiske og mekaniske forhold for hjelpemaskineri.

source: apply GIS analysis to answer information needs
nb: anvende GIS-analyse i den hensikt å besvare informasjonsbehov

source: Sub-routines and interrupt routines.
nb: Subrutiner og avbruddsrutiner.

source: At the end of the week, students submit the course's first work requirements (group submission).
nb: Som avslutning på uken innleverer studentene emnets første arbeidskrav (gruppeinnlevering).

source: make sensible material choices and consider appropriate corrosion protection of marine constructions.
nb: treffe fornuftige materialvalg og vurdere hensiktsmessig korrosjonsbeskyttelse av marine konstruksjoner.

source: • describe methods for risk assessment, security requirements and security certification and accreditation
nb: • beskrive metoder for risikovurderinger, sikkerhetskrav og sikkerhetsgodkjenning

source: specify and construct composite computer systems for monitoring physical systems, storage of data and presentation of data
nb: spesifisere og konstruere sammensatte datasystemer for overvåking av fysiske systemer, lagring av data og presentasjon av data

source: In addition to the military programme of professional study, which includes leadership and military power, the cadets acquire technical and operative engineering expertise in operational, management, operation and maintenance of machinery, hull and associated systems in the Navy.
nb: I tillegg til den militære profesjonsutdanningen, som inneholder lederskap og militærmakt, får kadettene teknisk og operativ ingeniørkompetanse innenfor operasjon, ledelse, drift og vedlikehold av skipselektriske anlegg og automasjonsanlegg i Sjøforsvaret.
